## What is loc and iloc?
--->These are pandas methods to filter/select data from pandas dataframe
--->loc is label based
--->iloc is index based

In [1]:
import pandas as pd

In [2]:
##Creating a dataframe
sonu_marks=[{'Maths':92,'Sanskrit':93,'Physics':94,'Chemistry':95,'History':85,'Geography':80,'English':78},{'Maths':87,'Sanskrit':91,'Physics':89,'Chemistry':85,'History':80,'Geography':75,'English':83},{'Maths':90,'Sanskrit':91,'Physics':78,'Chemistry':81,'History':82,'Geography':76,'English':82},{'Maths':96,'Sanskrit':90,'Physics':80,'Chemistry':81,'History':78,'Geography':72,'English':81},{'Maths':88,'Sanskrit':90,'Physics':75,'Chemistry':71,'History':82,'Geography':72,'English':83}]
dataframe=pd.DataFrame(sonu_marks,index=['exam1','exam2','exam3','exam4','exam5'])
print(dataframe)

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English
exam1     92        93       94         95       85         80       78
exam2     87        91       89         85       80         75       83
exam3     90        91       78         81       82         76       82
exam4     96        90       80         81       78         72       81
exam5     88        90       75         71       82         72       83

In [3]:
#Selecting a row using loc
print(dataframe.loc['exam3']) # 'exam3' is the  label of row

Maths        90
Sanskrit     91
Physics      78
Chemistry    81
History      82
Geography    76
English      82
Name: exam3, dtype: int64

In [4]:
#Selecting the same row using iloc
print(dataframe.iloc[2]) # 2 is the index of exam3,in python indexing starts from 0

Maths        90
Sanskrit     91
Physics      78
Chemistry    81
History      82
Geography    76
English      82
Name: exam3, dtype: int64

In [5]:
#Selecting any column using loc
dataframe.loc[:,'Physics']  #df.loc[R,C]

exam1    94
exam2    89
exam3    78
exam4    80
exam5    75
Name: Physics, dtype: int64

In [6]:
#Selecting any column using iloc
dataframe.iloc[:,2]  #df.iloc[R,C]

exam1    94
exam2    89
exam3    78
exam4    80
exam5    75
Name: Physics, dtype: int64

In [7]:
#Selecting specific value(Sanskrit marks in exam4) using loc
dataframe.loc['exam4','Sanskrit']

90

In [8]:
#Selecting specific value(Sanskrit marks in exam4) using iloc
dataframe.iloc[3,1]

90

In [10]:
#Selecting range of values from rows and columns using loc
dataframe.loc['exam2':'exam4', 'Physics':'Geography']

       Physics  Chemistry  History  Geography
exam2       89         85       80         75
exam3       78         81       82         76
exam4       80         81       78         72

In [11]:
#Selecting range of values from rows and columns using iloc
dataframe.iloc[1:4,2:6]   #Last index in not inclusive

       Physics  Chemistry  History  Geography
exam2       89         85       80         75
exam3       78         81       82         76
exam4       80         81       78         72

In [12]:
#Selecting rows with condition
dataframe.loc[dataframe.Maths >= 90]

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English
exam1     92        93       94         95       85         80       78
exam3     90        91       78         81       82         76       82
exam4     96        90       80         81       78         72       81

In [13]:
dataframe.loc[(dataframe.Maths >= 90) & (dataframe.English >= 80)]

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English
exam3     90        91       78         81       82         76       82
exam4     96        90       80         81       78         72       81

In [14]:
#Sum along the row
dataframe['Total']=dataframe.iloc[:,:].sum(axis=1) #Axis 1 means horizontally axis 0 means vertically
dataframe

       Maths  Sanskrit  Physics  Chemistry  History  Geography  English  Total
exam1     92        93       94         95       85         80       78    617
exam2     87        91       89         85       80         75       83    590
exam3     90        91       78         81       82         76       82    580
exam4     96        90       80         81       78         72       81    578
exam5     88        90       75         71       82         72       83    561